---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.ColorDepth
source: html/40291119-d43c-8246-053c-53bcac86813f.htm
---
# Autodesk.Revit.DB.PrintParameters.ColorDepth Property

The color depth type.

## Syntax (C#)
```csharp
public ColorDepthType ColorDepth { get; set; }
```